#########################(1) vector 例子#########################
#################################################################

  ### 1.vector造法
    a1=c(2,1,3,1)
    b1=1:4
    c1=seq(1,8,3)
    d1=c(a1,b1)
    e1=c(d1,"a") #字串可以跟數字向量合在一起，但是會把其他資料都變成字串
    
  ### 2.vector 取值
    a1[1]
    a1[2]
  
  ### 3.vector 運算
    a1*b1   #各分量相乘
    a1%*%b1 #向量內積計算
    a1^4    #各分量4次方
    2*a1+1  #個分量全部*2+1
  
  ### 4. vector 特色
    #(i)向量可以直接放在 for 迴圈判斷式迭代
      d1
      for(i in 1:length(d1)){
        print(d1[i])
      }
      
      e1
      for(i in e1){
        print(i)
      }
    #(ii) 長度資訊
      length(e1)

########################(2) matrix 例子 #############################
######################################################################

  ###1. 矩陣造法
    #(i) 一般取法
      a2=matrix(1:9,3,3)
      a2
    
    #(ii) rbind,cbind
      b2=c(2,1,3,1)
      c2=1:4
      d2=c("a","b","c","d")
      
      cbind(a2,b2)
      rbind(a2,b2)
    
      cbind(b2,c2,d2) # 與vector一樣只能存一種資料格式（兩者都是array的特例）
      
  ###2. 矩陣取值
      e2=a2
      e2[3,1] #(3,1)位置
      e2[,1]  #拿出第一列
      e2[1,]  #拿出第一行
      e2[1,1:2] #拿出第一行,第一列到第二列
      e2[1:2,1:2] 
  
  ###3. 矩陣運算
      e2
      f2=matrix(1:3,3,1)
      
      2*e2+1 # 
      e2%*%f2# 矩陣乘法
    
  
  ###4. 矩陣特色
    #(i). 行列命名
    
      g2=a2
      colnames(g2)=c("a","b","c")
      rownames(g2)=c("d","e","f")
      g2
    
    #(ii) 可以放在for 迴圈內迭代
      for(i in g2){
        print(i)
      }
    
    #(iii) 維度資訊
      length(g2)
      nrow(g2)
      ncol(g2)
      dim(g2)
    

########################(3) array 例子 #############################
######################################################################

  ### 1.array 造法
      
      a3=array(1:8,c(2,2,2)) 
      b3=array(1:4,c(2,3,2)) #不足的部分重複向量填滿
    
  
  ### 2. array 取值（與矩陣相同）
      
      a3[1,1,1]
      a3[1,,]
      a3[,1,]
      a3[,,1]
  
  ### 3. array 運算 （與矩陣相同）
  
  ###4. array特色
    
    #(i)每個dimension可以命名，可以方便知道每個變數的意義
      
      colnames(b3)=c("ㄅ","ㄆ","ㄇ")
      rownames(b3)=c("你","好")
      dimnames(b3)[[3]]=c("d","i")
      b3



########################(4) dataframe 例子 #############################
########################################################################

  ###1. dataframe 造法
  
    a4 <- data.frame(
      x = letters[1:6],
      y = rnorm(6),
      z = runif(6) > 0.5
    )
    
    b4= data.frame(letters[1:6],rnorm(6),runif(6) > 0.5)
    colnames(b4)=c('x','y','z')
    rownames(b4)=c('row1','row2','row3','row4','row5','row6')
    
  ###2. dataframe 取值
  
    b4[1] #拿出第一列
    b4[2:4,] #拿出2~4行
    b4$x # $取列
    
  ###3. dataframe 運算方法  
  
    as.matrix(b4[,2]) #基本上如果要運算就使用as.matrix轉換成矩陣做運算
    as.matrix(b4$x)
    as.matrix(b4)
    
  ###4. dataframe 特色
    
    #** dataframe 使用上與矩陣十分相似，以下列舉幾個dataframe的特點
    #** dataframe 裡面可以容納各種不同的資料型態（矩陣、陣列、向量無法做到）
    #** dataframe 在取columns的時候如果有給定表頭，可以使用$取值
    

########################(5) list 例子 ##################################
########################################################################
    
    ###1. list 造法 (list 中可以包含list,向量,字符等元素)
    a5=list(1,2,list(1,1,3),c(1,2,3,4),"a")
    b5=list(id="0553934",name="Jimmy",Gender="Male")
    c5=list(b5,b5)
    
    ###2. list 取值 若有名稱用$ 若沒有名稱用[[]]
    b5[1] # 無法取值
    b5[[1]]
    b5$id
    

    ###3. list 運算方法  (學會取值運算靠matrix)
    

    ###4. list 特色
    # 可以包含較為複雜的資料型態
    # 許多函數的輸出如lm(),summary()....的資料型態都是一種list，因此一定要會使用

    